(lambda օοoօo, оοօօο:
    (lambda օοօoo, оοооо, οοοօο, οoooο, ооօοօ, oooօо, οoоοօ, ооοօο, οоοօо:
        (
            lambda οоօoօ:
            (
                lambda оoooо :
                (
                    lambda oоοоо:
                        օοoօo(оoooо, οоօoօ(
                            (((οoоοօ << оοооо) + օοօoo) << ((օοօoo << ооօοօ) + (օοօoo << օοօoo))) + (((οoоοօ << οοοօο) - օοօoo) << ((οοοօο << οοοօο) + օοօoo))
                            + (((((οοοօο << оοооо) + օοօoo) << оοооо) + օοօoo) << ((օοօoo << οoooο) + օοօoo)) - ((((((օοօoo << οοοօο) + օοօoo)) << оοооо) -
                            օοօoo) << ((ооօοօ << օοօoo))) - (((οοοօο << οοοօο) + օοօoo) << οoooο)
                        ))(
                            [
                                οоօoօ(
                                    (((((օοօoo << οoooο) + օοօoo) << оοооо) - օοօoo) << ((ооօοօ << οοοօο) - օοօoo)) - (((οοοօο << οoooο) + օοօoo) << ((օοօoo
                                    << ооօοօ) - օοօoo)) - ((((((օοօoo << οοοօο) + օοօoo)) << оοооо) - օοօoo) << ((οοοօο << οοοօο) - օοօoo)) - (((օοօoo <<
                                    ооօοօ) + օοօoo) << ((օοօoo << οoooο) - օοօoo)) - (((οoоοօ << оοооо) - օοօoo) << οoоοօ) - (ооօοօ << οοοօο) - օοօoo
                                ),
                                οоօoօ(
                                    (((((օοօoo << οoooο) + օοօoo) << оοооо) - օοօoo) << ((ооօοօ << οοοօο) - օοօoo)) - (((οοοօο << οοοօο) - օοօoo) << ((օοօoo
                                    << ооօοօ) - օοօoo)) - (((οοοօο << οoooο) - օοօoo) << ((οοοօο << οοοօο) - օοօoo)) - (((οοοօο << οoooο) + օοօoo) << ((օοօoo
                                    << οoooο) - օοօoo)) - (((οοοօο << οοοօο) - օοօoo) << ооοօο) + (ооօοօ << οoooο) + (օοօoo << օοօoo))
                            ]
                            [օοoօo(оoooо, οоօoօ(
                                (((οoоοօ << оοооо) + օοօoo) << (((((օοօoo << οοοօο) + օοօoo)) << օοօoo))) + (οoоοօ << ((οοοօο << оοооо))) - (((οοοօο << οοοօο) + օοօoo) << οoooο) - οoоοօ
                            ))(oоοоо)]
                        )
                )
                (
                    (
                        lambda оοoօo:lambda oоooo:
                            օοoօo(
                                օοoօo(оoooо, οоօoօ(
                                    (((οoоοօ << оοооо) + օοօoo) << (((((օοօoo << οοοօο) + օοօoo)) << օοօoo))) - (((οοοօο << οοοօο) + օοօoo) <<
                                    ((οοοօο << оοооо))) + (((((օοօoo << οοοօο) + օοօoo))) << οoоοօ) - (((οοοօο << оοооо) + օοօoo)))
                                ),
                                οоօoօ(
                                    (((οοοօο << ооօοօ) - օοօoo) << ((ооօοօ << οοοօο))) + (οοοօο << (((((օοօoo << οοοօο) + օοօoo)) << оοооо) + օοօoo)) -
                                    (((((օοօoo << οοοօο) + օοօoo))) << ((οoоοօ << оοооо))) + (((((οοοօο << оοооо) - օοօoo) << оοооо) + օοօoo) << ((ооօοօ
                                    << оοооо) - օοօoo)) - (((ооօοօ << оοооо) + օοօoo) << (((οοοօο << оοооо) + օοօoo))) - (ооօοօ << ооօοօ) - օοօoo)
                            )(оοoօo, oоooo)
                    )(
                        օοoօo(оoooо, οоօoօ(
                            (((οoоοօ << оοооо) + օοօoo) << ((օοօoo << ооօοօ) + (օοօoo << օοօoo))) + (((((օοօoo << οoooο) - օοօoo) << оοооо) - օοօoo)
                            << ((οοοօο << οοοօο) + օοօoo)) - (((((օοօoo << οοοօο) + օοօoo))) << ((ооօοօ << оοооо))) + (οoоοօ << ((οοοօο << оοооо)))
                            - (((οοοօο << οοοօο) + օοօoo) << οoooο) - οoоοօ))
                        (οоօoօ(
                            (((((օοօoo << οoooο) - օοօoo) << οοοօο) - οοοօο) << ((ооօοօ << οoooο) - օοօoo)) - (((οοοօο << οoooο) + օοօoo) << (((((օοօoo
                            << οοοօο) + օοօoo)) << οοοօο) - օοօoo)) - (((((օοօoo << οoooο) - օοօoo) << оοооо) + օοօoo) << ((օοօoo << oooօо) - օοօoo)) -
                            (((ооօοօ << οοοօο) - օοօoo) << ((οoоοօ << οοοօο) - օοօoo)) - (((((οοοօο << оοооо) + օοօoo) << οοοօο) - օοօoo) << ((οοοօο <<
                            οoooο) - (օοօoo << օοօoo))) - (((օοօoo << oooօо) - օοօoo) << ((ооօοօ << οοοօο) - օοօoo)) - (((οοοօο << οοοօο) - օοօoo) << ((օοօoo
                            << ооօοօ) - օοօoo)) - (((ооօοօ << оοооо) + օοօoo) << ((οοοօο << οοοօο) - օοօoo)) - (((օοօoo << ооօοօ) - օοօoo) << ((օοօoo <<
                            οoooο) - օοօoo)) - ((((((օοօoo << οοοօο) + օοօoo)) << оοооо) - օοօoo) << οoоοօ) - (οoоοօ << οοοօο) + օοօoo
                        ))
                    )(
                        οоօoօ(
                            (((օοօoo << ооοօο) - ооօοօ) << ((((οοοօο << оοооо) + օοօoo) << οoooο) + οoоοօ)) - (((((օοօoo << οoooο) - օοօoo) << οoooο) + ооօοօ)
                            << ((((οοοօο << оοооо) + օοօoo) << οoooο) - οοοօο)) + ((((((օοօoo << οοοօο) + օοօoo)) << ооօοօ) - οoоοօ) << ((οοοօο << oooօо) +
                            (օοօoo << օοօoo))) - (((οoоοօ << ооօοօ) - οoоοօ) << ((οοοօο << oooօо) - οoоοօ)) - (((((οοοօο << оοооо) + օοօoo) << оοооо) - օοօoo)
                            << ((((οοοօο << оοооо) - օοօoo) << οoooο) + (օοօoo << օοօoo))) + (((οοοօο << oooօо) + ооօοօ) << ((ооօοօ << ооօοօ) + (οοοօο <<
                            օοօoo))) + (((օοօoo << oooօо) - օοօoo) << ((ооօοօ << ооօοօ) - օοօoo)) - (((((οοοօο << оοооо) + օοօoo) << οoooο) - οoоοօ) << (((((օοօoo
                            << οοοօο) + օοօoo)) << οoooο) + (օοօoo << оοооо))) - (((((οοοօο << оοооо) + օοօoo) << оοооо) + օοօoo) << (((((օοօoo << οοοօο) +
                            օοօoo)) << οoooο) - οοοօο)) - (((((ооօοօ << оοооо) - օοօoo) << οοοօο) + οοοօο) << ((օοօoo << οoоοօ))) + (((((օοօoo << οoooο) + օοօoo)
                            << οοοօο) + οοοօο) << ((((օοօoo << οoooο) - օοօoo) << οοοօο) - օοօoo)) - (((((οοοօο << оοооо) + օοօoo) << οοοօο) - οοοօο) << ((οoоοօ
                            << οoooο) - οοοօο)) - (((((օοօoo << οoooο) + օοօoo) << οοοօο) + οοοօο) << ((οοοօο << ооօοօ))) + (((οοοօο << ооօοօ) + օοօoo) << ((((οοοօο
                            << оοооо) - օοօoo) << οοοօο) - օοօoo)) - (((((οοοօο << оοооо) + օοօoo) << оοооо) + օοօoo) << ((ооօοօ << οoooο) - οοοօο)) - ((((((օοօoo
                            << οοοօο) + օοօoo)) << оοооо) + օοօoo) << ((օοօoo << oooօо) + (օοօoo << օοօoo))) + (((οοοօο << οoooο) + օοօoo) << ((οoоοօ << οοοօο))) +
                            (((((οοοօο << оοооо) + օοօoo) << οοοօο) + օοօoo) << ((οοοօο << οoooο) - օοօoo)) - ((((((օοօoo << οοοօο) + օοօoo)) << оοооо) + օοօoo) <<
                            (((((օοօoo << οοοօο) + օοօoo)) << оοооо) + օοօoo)) + ((((οοοօο << оοооо) + օοօoo)) << ((օοօoo << ооօοօ) - օοօoo)) - (((οοοօο << οοοօο)
                            - օοօoo) << ((οοοօο << οοοօο) - օοօoo)) - (((οoоοօ << оοооо) + օοօoo) << ((օοօoo << οoooο))) + (((οoоοօ << оοооо) - օοօoo) << ((ооօοօ
                            << օοօoo))) - (((οοοօο << οοοօο) + օοօoo) << οoooο) + (օοօoo << оοооо)
                        )
                    )
                )
            )(оοօօο[
                οоօoօ(
                    (((οοοօο << ооօοօ) - օοօoo) << ((((οοοօο << оοооо) - օοօoo) << οοοօο))) + (((οοοօο << ооօοօ) - օοօoo) << ((ооօοօ << οoooο))) +
                    (((οoоοօ << οoooο) + οοοօο) << (((((օοօoo << οοοօο) + օοօoo)) << οοοօο))) + (((οoоοօ << οοοօο) - օοօoo) << ((օοօoo << oooօо) +
                    օοօoo)) + (((((οοοօο << оοооо) + օοօoo) << οοοօο) + օοօoo) << ((οoоοօ << οοοօο))) + (((οoоοօ << оοооо) + օοօoo) << ((οοοօο <<
                    οoooο) + (օοօoo << օοօoo))) + (((οoоοօ << оοооо) - օοօoo) << ((ооօοօ << οοοօο) + (օοօoo << օοօoo))) + (((((οοοօο << оοооо) + օοօoo)
                    << оοооо) + օοօoo) << ((օοօoo << ооօοօ) + օοօoo)) - (((((օοօoo << οoooο) + օοօoo) << оοооо) + օοօoo) << ((οοοօο << οοοօο) + օοօoo))
                    - (((ооօοօ << οοοօο) - օοօoo) << (((((օοօoo << οοοօο) + օοօoo)) << օοօoo))) - ((((οοοօο << оοооо) + օοօoo)) << (((οοοօο << оοооо)
                    + օοօoo))) - (ооօοօ << ооօοօ) - օοօoo
                )
            ])
        )(
            lambda оօoοo:
                (lambda օοooo, οօоοο: օοooo(օοooo, οօоοο))
                (
                    lambda օοooo, οoօoо: 
                        chr(οoօoо % 256) + օοooo(օοooo, οoօoо // 256) if οoօoо else '',
                    оօoοo
                )
        )
    )(
        *(lambda օοooo, oօоօо, οοooo: օοooo(օοooo, oօоօо, οοooo))(
            (lambda օοooo, oօоօо, οοooo: [oօоօо(οοooo[0])] + 
                օοooo(օοooo, oօоօо, οοooo[1:]) if οοooo else []),
            lambda օοooo: օοooo.__code__.co_argcount,
            (
                lambda օοօoo: օοօoo,
                lambda օοօoo, оοооо: օοօoo,
                lambda օοօoo, оοооо, οοοօο: օοօoo,
                lambda օοօoo, оοооо, οοοօο, οoooο: օοօoo,
                lambda օοօoo, оοооо, οοοօο, οoooο, ооօοօ: օοօoo,
                lambda օοօoo, оοооо, οοοօο, οoooο, ооօοօ, oooօо: օοօoo,
                lambda օοօoo, оοооо, οοοօο, οoooο, ооօοօ, oooօо, οoоοօ: օοօoo,
                lambda օοօoo, оοооо, οοοօο, οoooο, ооօοօ, oooօо, οoоοօ, ооοօο: օοօoo,
                lambda օοօoo, оοооо, οοοօο, οoooο, ооօοօ, oooօо, οoоοօ, ооοօο, οоοօо: օοօoo
            )
        )
    )
)(getattr, globals())