օοօoo, оοооо, οοοօο, οoooο, ооօοօ, oooօо, οoоοօ, ооοօο, οоοօо = range(1, 10)
οоօoօ = lambda оօoοo: (lambda օοooo, οօоοο: օοooo(օοooo, οօоοο))(lambda օοooo, οoօoо: chr(οoօoо % 256) + օοooo(օοooo, οoօoо // 256) if οoօoо else '', оօoοo)
flag = οоօoօ(
    (((օοօoo << ооοօο) - ооօοօ) << ((((οοοօο << оοооо) + օοօoo) << οoooο) + οoоοօ)) - (((((օοօoo << οoooο) - օοօoo) << οoooο) + ооօοօ)
    << ((((οοοօο << оοооо) + օοօoo) << οoooο) - οοοօο)) + ((((((օοօoo << οοοօο) + օοօoo)) << ооօοօ) - οoоοօ) << ((οοοօο << oooօо) +
    (օοօoo << օοօoo))) - (((οoоοօ << ооօοօ) - οoоοօ) << ((οοοօο << oooօо) - οoоοօ)) - (((((οοοօο << оοооо) + օοօoo) << оοооо) - օοօoo)
    << ((((οοοօο << оοооо) - օοօoo) << οoooο) + (օοօoo << օοօoo))) + (((οοοօο << oooօо) + ооօοօ) << ((ооօοօ << ооօοօ) + (οοοօο <<
    օοօoo))) + (((օοօoo << oooօо) - օοօoo) << ((ооօοօ << ооօοօ) - օοօoo)) - (((((οοοօο << оοооо) + օοօoo) << οoooο) - οoоοօ) << (((((օοօoo
    << οοοօο) + օοօoo)) << οoooο) + (օοօoo << оοооо))) - (((((οοοօο << оοооо) + օοօoo) << оοооо) + օοօoo) << (((((օοօoo << οοοօο) +
    օοօoo)) << οoooο) - οοοօο)) - (((((ооօοօ << оοооо) - օοօoo) << οοοօο) + οοοօο) << ((օοօoo << οoоοօ))) + (((((օοօoo << οoooο) + օοօoo)
    << οοοօο) + οοοօο) << ((((օοօoo << οoooο) - օοօoo) << οοοօο) - օοօoo)) - (((((οοοօο << оοооо) + օοօoo) << οοοօο) - οοοօο) << ((οoоοօ
    << οoooο) - οοοօο)) - (((((օοօoo << οoooο) + օοօoo) << οοοօο) + οοοօο) << ((οοοօο << ооօοօ))) + (((οοοօο << ооօοօ) + օοօoo) << ((((οοοօο
    << оοооо) - օοօoo) << οοοօο) - օοօoo)) - (((((οοοօο << оοооо) + օοօoo) << оοооо) + օοօoo) << ((ооօοօ << οoooο) - οοοօο)) - ((((((օοօoo
    << οοοօο) + օοօoo)) << оοооо) + օοօoo) << ((օοօoo << oooօо) + (օοօoo << օοօoo))) + (((οοοօο << οoooο) + օοօoo) << ((οoоοօ << οοοօο))) +
    (((((οοοօο << оοооо) + օοօoo) << οοοօο) + օοօoo) << ((οοοօο << οoooο) - օοօoo)) - ((((((օοօoo << οοοօο) + օοօoo)) << оοооо) + օοօoo) <<
    (((((օοօoo << οοοօο) + օοօoo)) << оοооо) + օοօoo)) + ((((οοοօο << оοооо) + օοօoo)) << ((օοօoo << ооօοօ) - օοօoo)) - (((οοοօο << οοοօο)
    - օοօoo) << ((οοοօο << οοοօο) - օοօoo)) - (((οoоοօ << оοооо) + օοօoo) << ((օοօoo << οoooο))) + (((οoоοօ << оοооо) - օοօoo) << ((ооօοօ
    << օοօoo))) - (((οοοօο << οοοօο) + օοօoo) << οoooο) + (օοօoo << оοооо)
)
print(flag)